In [1]:
%matplotlib inline
# Dependencies
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
# Load in csv
bin_usage_df = pd.read_csv("bin_usage.csv")
bin_usage_df

,sn,streamtype,timestamp,level,invalid_the_geom
0,1400016,Trash,06/06/2014 02:04:00 PM,RED,"(39.9951, -75.1395)"
1,172206,Trash,06/16/2014 04:29:00 PM,RED,"(39.946, -75.1578)"
2,173269,Trash,06/16/2014 12:59:00 PM,RED,"(40.003, -75.1659)"
3,173209,Trash,06/12/2014 12:35:00 PM,GREEN,"(39.9533, -75.2174)"
4,173041,Trash,06/12/2014 10:38:00 AM,GREEN,"(40.0585, -75.1894)"
...,...,...,...,...,...
53863,171821,Trash,01/01/2014 12:04:00 AM,YELLOW,"(39.95017402, -75.18092682)"
53864,174535,Trash,01/01/2014 12:03:00 AM,RED,"(39.97882609, -75.15801913)"
53865,173114,Trash,01/01/2014 12:00:00 AM,GREEN,"(40.0363, -75.1304)"
53866,174544,Trash,01/01/2014 12:00:00 AM,GREEN,"(39.98636987, -75.15632146)"
53867,1401947,Trash,01/01/2014 12:00:00 AM,YELLOW,"(39.95289401, -75.14500629)"

In [2]:
# Get the columns and the rows that are not null.
bin_usage_df.count()

sn                  53868
streamtype          53868
timestamp           53868
level               53868
invalid_the_geom    53868
dtype: int64

In [3]:
# Get the data types of each column.
bin_usage_df.dtypes

sn                   int64
streamtype          object
timestamp           object
level               object
invalid_the_geom    object
dtype: object

In [4]:
bin_usage_df.rename(columns={"sn": "serialnum"})

,serialnum,streamtype,timestamp,level,invalid_the_geom
0,1400016,Trash,06/06/2014 02:04:00 PM,RED,"(39.9951, -75.1395)"
1,172206,Trash,06/16/2014 04:29:00 PM,RED,"(39.946, -75.1578)"
2,173269,Trash,06/16/2014 12:59:00 PM,RED,"(40.003, -75.1659)"
3,173209,Trash,06/12/2014 12:35:00 PM,GREEN,"(39.9533, -75.2174)"
4,173041,Trash,06/12/2014 10:38:00 AM,GREEN,"(40.0585, -75.1894)"
...,...,...,...,...,...
53863,171821,Trash,01/01/2014 12:04:00 AM,YELLOW,"(39.95017402, -75.18092682)"
53864,174535,Trash,01/01/2014 12:03:00 AM,RED,"(39.97882609, -75.15801913)"
53865,173114,Trash,01/01/2014 12:00:00 AM,GREEN,"(40.0363, -75.1304)"
53866,174544,Trash,01/01/2014 12:00:00 AM,GREEN,"(39.98636987, -75.15632146)"
53867,1401947,Trash,01/01/2014 12:00:00 AM,YELLOW,"(39.95289401, -75.14500629)"

In [10]:
bin_usage_df.streamtype.value_counts()

Trash    53868
Name: streamtype, dtype: int64

In [11]:
bin_usage_df.level.value_counts()

GREEN     25709
YELLOW    19540
RED        8619
Name: level, dtype: int64